Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_EF_DFP/1.0.29/atdf/PIC32MZ1024EFH144.atdf
      <value-group caption="Trigger Level and Edge Sensitivity bit 8" name="ADCTRGSNS__LVL8">
         <value caption="Analog input is sensitive to the high level of its trigger (level sensitivity implies retriggering as long as the trigger signal remains high)" name="" value="0x1"/>
         <value caption="Analog input is sensitive to the positive edge of its trigger (this is the value after a reset)" name="" value="0x0"/>
      </value-group>
      <value-group caption="Trigger Level and Edge Sensitivity bit 9" name="ADCTRGSNS__LVL9">
         <value caption="Analog input is sensitive to the high level of its trigger (level sensitivity implies retriggering as long as the trigger signal remains high)" name="" value="0x1"/>
         <value caption="Analog input is sensitive to the positive edge of its trigger (this is the value after a reset)" name="" value="0x0"/>
      </value-group>
      <value-group caption="Trigger Level and Edge Sensitivity bit 10" name="ADCTRGSNS__LVL10">
         <value caption="Analog input is sensitive to the high level of its trigger (level sensitivity implies retriggering as long as the trigger signal remains high)" name="" value="0x1"/>
         <value caption="Analog input is sensitive to the positive edge of its trigger (this is the value after a reset)" name="" value="0x0"/>
      </value-group>
      <value-group caption="Trigger Level and Edge Sensitivity bit 11" name="ADCTRGSNS__LVL11">
         <value caption="Analog input is sensitive to the high level of its trigger (level sensitivity implies retriggering as long as the trigger signal remains high)" name="" value="0x1"/>
         <value caption="Analog input is sensitive to the positive edge of its trigger (this is the value after a reset)" name="" value="0x0"/>
      </value-group>
      <value-group caption="ADCx Sample Time bits" name="ADC0TIME__SAMC">
         <value caption="1025 Tadx" name="" value="0x3ff"/>
         <value caption="3 Tadx" name="" value="0x1"/>
         <value caption="2 Tadx" name="" value="0x0"/>
      </value-group>
      <value-group caption="ADCx Clock Divisor bits" name="ADC0TIME__ADCDIV">
         <value caption="254 * Tq = Tadx" name="" value="0x7f"/>
         <value caption="6 * Tq = Tadx" name="" value="0x3"/>
         <value caption="4 * Tq = Tadx" name="" value="0x2"/>
         <value caption="2 * Tq = Tadx" name="" value="0x1"/>
         <value caption="Reserved" name="" value="0x0"/>
      </value-group>
      <value-group caption="ADCx Resolution Select bits" name="ADC0TIME__SELRES">
         <value caption="12 bits" name="" value="0x3"/>
         <value caption="10 bits" name="" value="0x2"/>
         <value caption="8 bits" name="" value="0x1"/>
         <value caption="6 bits" name="" value="0x0"/>
      </value-group>
      <value-group caption="ADCx Early Interrupt Select bits" name="ADC0TIME__ADCEIS">
         <value caption="The data ready interrupt is generated 8 ADC clocks prior to the end of conversion" name="" value="0x7"/>
         <value caption="The data ready interrupt is generated 7 ADC clocks prior to the end of conversion" name="" value="0x6"/>
         <value caption="The data ready interrupt is generated 6 ADC clocks prior to the end of conversion" name="" value="0x5"/>
         <value caption="The data ready interrupt is generated 5 ADC clocks prior to the end of conversion" name="" value="0x4"/>
         <value caption="The data ready interrupt is generated 4 ADC clocks prior to the end of conversion" name="" value="0x3"/>
         <value caption="The data ready interrupt is generated 3 ADC clocks prior to the end of conversion" name="" value="0x2"/>
         <value caption="The data ready interrupt is generated 2 ADC clocks prior to the end of conversion" name="" value="0x1"/>
         <value caption="The data ready interrupt is generated 1 ADC clock prior to the end of conversion" name="" value="0x0"/>
      </value-group>
      <value-group caption="ADCx Sample Time bits" name="ADC1TIME__SAMC">
         <value caption="1025 Tadx" name="" value="0x3ff"/>
         <value caption="3 Tadx" name="" value="0x1"/>
         <value caption="2 Tadx" name="" value="0x0"/>
      </value-group>
      <value-group caption="ADCx Clock Divisor bits" name="ADC1TIME__ADCDIV">
         <value caption="254 * Tq = Tadx" name="" value="0x7f"/>
         <value caption="6 * Tq = Tadx" name="" value="0x3"/>
         <value caption="4 * Tq = Tadx" name="" value="0x2"/>
         <value caption="2 * Tq = Tadx" name="" value="0x1"/>
         <value caption="Reserved" name="" value="0x0"/>
      </value-group>
      <value-group caption="ADCx Resolution Select bits" name="ADC1TIME__SELRES">
         <value caption="12 bits" name="" value="0x3"/>
         <value caption="10 bits" name="" value="0x2"/>
         <value caption="8 bits" name="" value="0x1"/>
         <value caption="6 bits" name="" value="0x0"/>
      </value-group>
      <value-group caption="ADCx Early Interrupt Select bits" name="ADC1TIME__ADCEIS">
         <value caption="The data ready interrupt is generated 8 ADC clocks prior to the end of conversion" name="" value="0x7"/>
         <value caption="The data ready interrupt is generated 7 ADC clocks prior to the end of conversion" name="" value="0x6"/>
         <value caption="The data ready interrupt is generated 6 ADC clocks prior to the end of conversion" name="" value="0x5"/>
         <value caption="The data ready interrupt is generated 5 ADC clocks prior to the end of conversion" name="" value="0x4"/>
         <value caption="The data ready interrupt is generated 4 ADC clocks prior to the end of conversion" name="" value="0x3"/>
         <value caption="The data ready interrupt is generated 3 ADC clocks prior to the end of conversion" name="" value="0x2"/>
         <value caption="The data ready interrupt is generated 2 ADC clocks prior to the end of conversion" name="" value="0x1"/>
         <value caption="The data ready interrupt is generated 1 ADC clock prior to the end of conversion" name="" value="0x0"/>
      </value-group>
      <value-group caption="ADCx Sample Time bits" name="ADC2TIME__SAMC">
         <value caption="1025 Tadx" name="" value="0x3ff"/>
         <value caption="3 Tadx" name="" value="0x1"/>
         <value caption="2 Tadx" name="" value="0x0"/>
      </value-group>
      <value-group caption="ADCx Clock Divisor bits" name="ADC2TIME__ADCDIV">
         <value caption="254 * Tq = Tadx" name="" value="0x7f"/>
         <value caption="6 * Tq = Tadx" name="" value="0x3"/>
         <value caption="4 * Tq = Tadx" name="" value="0x2"/>
         <value caption="2 * Tq = Tadx" name="" value="0x1"/>
         <value caption="Reserved" name="" value="0x0"/>
      </value-group>
      <value-group caption="ADCx Resolution Select bits" name="ADC2TIME__SELRES">
         <value caption="12 bits" name="" value="0x3"/>
         <value caption="10 bits" name="" value="0x2"/>
         <value caption="8 bits" name="" value="0x1"/>
         <value caption="6 bits" name="" value="0x0"/>
      </value-group>
      <value-group caption="ADCx Early Interrupt Select bits" name="ADC2TIME__ADCEIS">
         <value caption="The data ready interrupt is generated 8 ADC clocks prior to the end of conversion" name="" value="0x7"/>
         <value caption="The data ready interrupt is generated 7 ADC clocks prior to the end of conversion" name="" value="0x6"/>
         <value caption="The data ready interrupt is generated 6 ADC clocks prior to the end of conversion" name="" value="0x5"/>
         <value caption="The data ready interrupt is generated 5 ADC clocks prior to the end of conversion" name="" value="0x4"/>
         <value caption="The data ready interrupt is generated 4 ADC clocks prior to the end of conversion" name="" value="0x3"/>
         <value caption="The data ready interrupt is generated 3 ADC clocks prior to the end of conversion" name="" value="0x2"/>
         <value caption="The data ready interrupt is generated 2 ADC clocks prior to the end of conversion" name="" value="0x1"/>
         <value caption="The data ready interrupt is generated 1 ADC clock prior to the end of conversion" name="" value="0x0"/>
      </value-group>
      <value-group caption="ADCx Sample Time bits" name="ADC3TIME__SAMC">
         <value caption="1025 Tadx" name="" value="0x3ff"/>
         <value caption="3 Tadx" name="" value="0x1"/>
         <value caption="2 Tadx" name="" value="0x0"/>
      </value-group>
      <value-group caption="ADCx Clock Divisor bits" name="ADC3TIME__ADCDIV">
         <value caption="254 * Tq = Tadx" name="" value="0x7f"/>
         <value caption="6 * Tq = Tadx" name="" value="0x3"/>
         <value caption="4 * Tq = Tadx" name="" value="0x2"/>
         <value caption="2 * Tq = Tadx" name="" value="0x1"/>
         <value caption="Reserved" name="" value="0x0"/>
      </value-group>
      <value-group caption="ADCx Resolution Select bits" name="ADC3TIME__SELRES">
         <value caption="12 bits" name="" value="0x3"/>
         <value caption="10 bits" name="" value="0x2"/>
         <value caption="8 bits" name="" value="0x1"/>
         <value caption="6 bits" name="" value="0x0"/>
      </value-group>
      <value-group caption="ADCx Early Interrupt Select bits" name="ADC3TIME__ADCEIS">
         <value caption="The data ready interrupt is generated 8 ADC clocks prior to the end of conversion" name="" value="0x7"/>
         <value caption="The data ready interrupt is generated 7 ADC clocks prior to the end of conversion" name="" value="0x6"/>
         <value caption="The data ready interrupt is generated 6 ADC clocks prior to the end of conversion" name="" value="0x5"/>
         <value caption="The data ready interrupt is generated 5 ADC clocks prior to the end of conversion" name="" value="0x4"/>
         <value caption="The data ready interrupt is generated 4 ADC clocks prior to the end of conversion" name="" value="0x3"/>
         <value caption="The data ready interrupt is generated 3 ADC clocks prior to the end of conversion" name="" value="0x2"/>
         <value caption="The data ready interrupt is generated 2 ADC clocks prior to the end of conversion" name="" value="0x1"/>
         <value caption="The data ready interrupt is generated 1 ADC clock prior to the end of conversion" name="" value="0x0"/>
      </value-group>
      <value-group caption="ADCx Sample Time bits" name="ADC4TIME__SAMC">
         <value caption="1025 Tadx" name="" value="0x3ff"/>
         <value caption="3 Tadx" name="" value="0x1"/>
         <value caption="2 Tadx" name="" value="0x0"/>
      </value-group>
      <value-group caption="ADCx Clock Divisor bits" name="ADC4TIME__ADCDIV">
         <value caption="254 * Tq = Tadx" name="" value="0x7f"/>
         <value caption="6 * Tq = Tadx" name="" value="0x3"/>
         <value caption="4 * Tq = Tadx" name="" value="0x2"/>
         <value caption="2 * Tq = Tadx" name="" value="0x1"/>
         <value caption="Reserved" name="" value="0x0"/>
      </value-group>
      <value-group caption="ADCx Resolution Select bits" name="ADC4TIME__SELRES">
         <value caption="12 bits" name="" value="0x3"/>
         <value caption="10 bits" name="" value="0x2"/>
         <value caption="8 bits" name="" value="0x1"/>
         <value caption="6 bits" name="" value="0x0"/>
      </value-group>
      <value-group caption="ADCx Early Interrupt Select bits" name="ADC4TIME__ADCEIS">
         <value caption="The data ready interrupt is generated 8 ADC clocks prior to the end of conversion" name="" value="0x7"/>
         <value caption="The data ready interrupt is generated 7 ADC clocks prior to the end of conversion" name="" value="0x6"/>
         <value caption="The data ready interrupt is generated 6 ADC clocks prior to the end of conversion" name="" value="0x5"/>
         <value caption="The data ready interrupt is generated 5 ADC clocks prior to the end of conversion" name="" value="0x4"/>
         <value caption="The data ready interrupt is generated 4 ADC clocks prior to the end of conversion" name="" value="0x3"/>
         <value caption="The data ready interrupt is generated 3 ADC clocks prior to the end of conversion" name="" value="0x2"/>
         <value caption="The data ready interrupt is generated 2 ADC clocks prior to the end of conversion" name="" value="0x1"/>
         <value caption="The data ready interrupt is generated 1 ADC clock prior to the end of conversion" name="" value="0x0"/>
      </value-group>
      <value-group caption="Early Interrupt Enable for Analog Input bit 0" name="ADCEIEN1__EIEN0">
         <value caption="Early Interrupts are enabled for the selected analog input. The interrupt is generated after the early interrupt event occurs" name="" value="0x1"/>
         <value caption="Interrupts are disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Early Interrupt Enable for Analog Input bit 1" name="ADCEIEN1__EIEN1">
         <value caption="Early Interrupts are enabled for the selected analog input. The interrupt is generated after the early interrupt event occurs" name="" value="0x1"/>
         <value caption="Interrupts are disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Early Interrupt Enable for Analog Input bit 2" name="ADCEIEN1__EIEN2">
         <value caption="Early Interrupts are enabled for the selected analog input. The interrupt is generated after the early interrupt event occurs" name="" value="0x1"/>
         <value caption="Interrupts are disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Early Interrupt Enable for Analog Input bit 3" name="ADCEIEN1__EIEN3">
         <value caption="Early Interrupts are enabled for the selected analog input. The interrupt is generated after the early interrupt event occurs" name="" value="0x1"/>
         <value caption="Interrupts are disabled" name="" value="0x0"/>
      </value-group>
