Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_EF_DFP/1.0.29/atdf/PIC32MZ1024EFH144.atdf
      <value-group caption="FIFO Transmit FIFO Half Empty Interrupt Flag bit(1)" name="C2FIFOINT31__TXHALFIF">
         <value caption="1: (FIFO configured as a Transmit Buffer) 1 = FIFO is ? half full, 0 = FIFO is &gt; half full" name="" value="0x0"/>
         <value caption="0: (FIFO configured as a Receive Buffer) Unused, reads 0" name="" value="0x0"/>
      </value-group>
      <value-group caption="Transmit FIFO Not Full Interrupt Flag bit(1)" name="C2FIFOINT31__TXNFULLIF">
         <value caption="1: (FIFO configured as a Transmit Buffer) 1 = FIFO is not full, 0 = FIFO is full" name="" value="0x0"/>
         <value caption="0: (FIFO configured as a Receive Buffer) Unused, reads 0" name="" value="0x0"/>
      </value-group>
      <value-group caption="Empty Interrupt Enable bit" name="C2FIFOINT31__RXNEMPTYIE">
         <value caption="Interrupt enabled for FIFO not empty" name="" value="0x1"/>
         <value caption="Interrupt disabled for FIFO not empty" name="" value="0x0"/>
      </value-group>
      <value-group caption="FIFO Half Full Interrupt Enable bit" name="C2FIFOINT31__RXHALFIE">
         <value caption="Interrupt enabled for FIFO half full" name="" value="0x1"/>
         <value caption="Interrupt disabled for FIFO half full" name="" value="0x0"/>
      </value-group>
      <value-group caption="Full Interrupt Enable bit" name="C2FIFOINT31__RXFULLIE">
         <value caption="Interrupt enabled for FIFO full" name="" value="0x1"/>
         <value caption="Interrupt disabled for FIFO full" name="" value="0x0"/>
      </value-group>
      <value-group caption="Overflow Interrupt Enable bit" name="C2FIFOINT31__RXOVFLIE">
         <value caption="Interrupt enabled for overflow event" name="" value="0x1"/>
         <value caption="Interrupt disabled for overflow event" name="" value="0x0"/>
      </value-group>
      <value-group caption="Transmit FIFO Empty Interrupt Enable bit" name="C2FIFOINT31__TXEMPTYIE">
         <value caption="Interrupt enabled for FIFO empty" name="" value="0x1"/>
         <value caption="Interrupt disabled for FIFO empty" name="" value="0x0"/>
      </value-group>
      <value-group caption="Transmit FIFO Half Full Interrupt Enable bit" name="C2FIFOINT31__TXHALFIE">
         <value caption="Interrupt enabled for FIFO half full" name="" value="0x1"/>
         <value caption="Interrupt disabled for FIFO half full" name="" value="0x0"/>
      </value-group>
      <value-group caption="Transmit FIFO Not Full Interrupt Enable bit" name="C2FIFOINT31__TXNFULLIE">
         <value caption="Interrupt enabled for FIFO not full" name="" value="0x1"/>
         <value caption="Interrupt disabled for FIFO not full" name="" value="0x0"/>
      </value-group>
   </module>
   <module caption="" id="02787" name="CFG" version="">
      <register-group name="CFG">
         <register caption="Configuration Control Register" name="CFGCON" offset="0x0" rw="RW" size="4">
            <bitfield caption="TDO Enable for 2-Wire JTAG" mask="0x00000001" name="TDOEN" values="CFGCON__TDOEN"/>
            <bitfield caption="Trace Output Enable bit" mask="0x00000004" name="TROEN" values="CFGCON__TROEN"/>
            <bitfield caption="JTAG Port Enable bit" mask="0x00000008" name="JTAGEN" values="CFGCON__JTAGEN"/>
            <bitfield caption="Flash ECC Configuration bits" mask="0x00000030" name="ECCCON" values="CFGCON__ECCCON"/>
            <bitfield mask="0x00000080" name="IOANCPN"/>
            <bitfield caption="USB Suspend Sleep Enable bit(1)" mask="0x00000100" name="USBSSEN" values="CFGCON__USBSSEN"/>
            <bitfield caption="Permission Group Lock bit(1)" mask="0x00000800" name="PGLOCK" values="CFGCON__PGLOCK"/>
            <bitfield caption="Peripheral Module Disable bit(1)" mask="0x00001000" name="PMDLOCK" values="CFGCON__PMDLOCK"/>
            <bitfield caption="Peripheral Pin Select Lock bit(1)" mask="0x00002000" name="IOLOCK" values="CFGCON__IOLOCK"/>
            <bitfield caption="Output Compare Alternate Clock Selection bit(1)" mask="0x00010000" name="OCACLK" values="CFGCON__OCACLK"/>
            <bitfield caption="Input Capture Alternate Clock Selection bit(1)" mask="0x00020000" name="ICACLK" values="CFGCON__ICACLK"/>
            <bitfield caption="CPU Arbitration Priority to SRAM When Servicing an Interrupt bit(1)" mask="0x01000000" name="CPUPRI" values="CFGCON__CPUPRI"/>
            <bitfield caption="DMA Read and DMA Write Arbitration Priority to SRAM bit(1)" mask="0x02000000" name="DMAPRI" values="CFGCON__DMAPRI"/>
         </register>
         <register caption="Device and Revision ID Register" name="DEVID" offset="0x20" rw="RW" size="4">
            <bitfield mask="0x0FFFFFFF" name="DEVID"/>
            <bitfield mask="0xF0000000" name="VER"/>
         </register>
         <register caption="" name="SYSKEY" offset="0x30" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="SYSKEY"/>
         </register>
         <register caption="" name="PMD1" offset="0x40" rw="RW" size="4">
            <bitfield mask="0x00000001" name="ADCMD"/>
            <bitfield mask="0x00001000" name="CVRMD"/>
         </register>
         <register caption="" name="PMD2" offset="0x50" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CMP1MD"/>
            <bitfield mask="0x00000002" name="CMP2MD"/>
         </register>
         <register caption="" name="PMD3" offset="0x60" rw="RW" size="4">
            <bitfield mask="0x00000001" name="IC1MD"/>
            <bitfield mask="0x00000002" name="IC2MD"/>
            <bitfield mask="0x00000004" name="IC3MD"/>
            <bitfield mask="0x00000008" name="IC4MD"/>
            <bitfield mask="0x00000010" name="IC5MD"/>
            <bitfield mask="0x00000020" name="IC6MD"/>
            <bitfield mask="0x00000040" name="IC7MD"/>
            <bitfield mask="0x00000080" name="IC8MD"/>
            <bitfield mask="0x00000100" name="IC9MD"/>
            <bitfield mask="0x00010000" name="OC1MD"/>
            <bitfield mask="0x00020000" name="OC2MD"/>
            <bitfield mask="0x00040000" name="OC3MD"/>
            <bitfield mask="0x00080000" name="OC4MD"/>
            <bitfield mask="0x00100000" name="OC5MD"/>
            <bitfield mask="0x00200000" name="OC6MD"/>
            <bitfield mask="0x00400000" name="OC7MD"/>
            <bitfield mask="0x00800000" name="OC8MD"/>
            <bitfield mask="0x01000000" name="OC9MD"/>
         </register>
