Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_EF_DFP/1.0.29/atdf/PIC32MZ1024EFH144.atdf
      <value-group caption="Enable Hash Table Filtering bit" name="ETHRXFC__HTEN">
         <value caption="Enable Hash Table Filtering" name="" value="0x1"/>
         <value caption="Disable Hash Table Filtering" name="" value="0x0"/>
      </value-group>
      <value-group caption="Receive FIFO Overflow Interrupt Enable bit" name="ETHIEN__RXOVFLWIE">
         <value caption="Enable RXOVFLW Interrupt" name="" value="0x1"/>
         <value caption="Disable RXOVFLW Interrupt" name="" value="0x0"/>
      </value-group>
      <value-group caption="Receive Buffer Not Available Interrupt Enable bit" name="ETHIEN__RXBUFNAIE">
         <value caption="Enable RXBUFNA Interrupt" name="" value="0x1"/>
         <value caption="Disable RXBUFNA Interrupt" name="" value="0x0"/>
      </value-group>
      <value-group caption="Transmitter Abort Interrupt Enable bit" name="ETHIEN__TXABORTIE">
         <value caption="Enable TXABORT Interrupt" name="" value="0x1"/>
         <value caption="Disable TXABORT Interrupt" name="" value="0x0"/>
      </value-group>
      <value-group caption="Transmitter Done Interrupt Enable bit" name="ETHIEN__TXDONEIE">
         <value caption="Enable TXDONE Interrupt" name="" value="0x1"/>
         <value caption="Disable TXDONE Interrupt" name="" value="0x0"/>
      </value-group>
      <value-group caption="RX Activity Interrupt Enable bit" name="ETHIEN__RXACTIE">
         <value caption="Enable RXACT Interrupt" name="" value="0x1"/>
         <value caption="Disable RXACT Interrupt" name="" value="0x0"/>
      </value-group>
      <value-group caption="Packet Pending Interrupt Enable bit" name="ETHIEN__PKTPENDIE">
         <value caption="Enable PKTPEND Interrupt" name="" value="0x1"/>
         <value caption="Disable PKTPEND Interrupt" name="" value="0x0"/>
      </value-group>
      <value-group caption="Receiver Done Interrupt Enable bit" name="ETHIEN__RXDONEIE">
         <value caption="Enable RXDONE Interrupt" name="" value="0x1"/>
         <value caption="Disable RXDONE Interrupt" name="" value="0x0"/>
      </value-group>
      <value-group caption="Full Watermark Interrupt Enable bit" name="ETHIEN__FWMARKIE">
         <value caption="Enable FWMARK Interrupt" name="" value="0x1"/>
         <value caption="Disable FWMARK Interrupt" name="" value="0x0"/>
      </value-group>
      <value-group caption="Empty Watermark Interrupt Enable bit" name="ETHIEN__EWMARKIE">
         <value caption="Enable EWMARK Interrupt" name="" value="0x1"/>
         <value caption="Disable EWMARK Interrupt" name="" value="0x0"/>
      </value-group>
      <value-group caption="Receive BVCI Bus Error Interrupt Enable bit" name="ETHIEN__RXBUSEIE">
         <value caption="Enable RXBUS Error Interrupt" name="" value="0x1"/>
         <value caption="Disable RXBUS Error Interrupt" name="" value="0x0"/>
      </value-group>
      <value-group caption="Transmit BVCI Bus Error Interrupt Enable bit" name="ETHIEN__TXBUSEIE">
         <value caption="Enable TXBUS Error Interrupt" name="" value="0x1"/>
         <value caption="Disable TXBUS Error Interrupt" name="" value="0x0"/>
      </value-group>
      <value-group caption="Receive FIFO Over Flow Error bit" name="ETHIRQ__RXOVFLW">
         <value caption="RX FIFO Overflow Error condition has occurred" name="" value="0x1"/>
         <value caption="No interrupt pending" name="" value="0x0"/>
      </value-group>
      <value-group caption="Receive Buffer Not Available Interrupt bit" name="ETHIRQ__RXBUFNA">
         <value caption="RX Buffer Descriptor Not Available condition has occurred" name="" value="0x1"/>
         <value caption="No interrupt pending" name="" value="0x0"/>
      </value-group>
      <value-group caption="Transmit Abort Condition Interrupt bit" name="ETHIRQ__TXABORT">
         <value caption="TX abort condition occurred on the last TX packet" name="" value="0x1"/>
         <value caption="No interrupt pending" name="" value="0x0"/>
      </value-group>
      <value-group caption="Transmit Done Interrupt bit" name="ETHIRQ__TXDONE">
         <value caption="TX packet was successfully sent" name="" value="0x1"/>
         <value caption="No interrupt pending" name="" value="0x0"/>
      </value-group>
      <value-group caption="Receive Activity Interrupt bit" name="ETHIRQ__RXACT">
         <value caption="RX packet data was successfully received" name="" value="0x1"/>
         <value caption="No interrupt pending" name="" value="0x0"/>
      </value-group>
      <value-group caption="Packet Pending Interrupt bit" name="ETHIRQ__PKTPEND">
         <value caption="RX packet pending in memory" name="" value="0x1"/>
         <value caption="RX packet is not pending in memory" name="" value="0x0"/>
      </value-group>
      <value-group caption="Receive Done Interrupt bit" name="ETHIRQ__RXDONE">
         <value caption="RX packet was successfully received" name="" value="0x1"/>
         <value caption="No interrupt pending" name="" value="0x0"/>
      </value-group>
      <value-group caption="Full Watermark Interrupt bit" name="ETHIRQ__FWMARK">
         <value caption="Full Watermark pointer reached" name="" value="0x1"/>
         <value caption="No interrupt pending" name="" value="0x0"/>
      </value-group>
      <value-group caption="Empty Watermark Interrupt bit" name="ETHIRQ__EWMARK">
         <value caption="Empty Watermark pointer reached" name="" value="0x1"/>
         <value caption="No interrupt pending" name="" value="0x0"/>
      </value-group>
      <value-group caption="Receive BVCI Bus Error Interrupt bit" name="ETHIRQ__RXBUSE">
         <value caption="BVCI Bus Error has occurred" name="" value="0x1"/>
         <value caption="BVCI Bus Error has not occurred" name="" value="0x0"/>
      </value-group>
      <value-group caption="Transmit BVCI Bus Error Interrupt bit" name="ETHIRQ__TXBUSE">
         <value caption="BVCI Bus Error has occurred" name="" value="0x1"/>
         <value caption="BVCI Bus Error has not occurred" name="" value="0x0"/>
      </value-group>
      <value-group caption="Receive Busy bit" name="ETHSTAT__RXBUSY">
         <value caption="RX logic is receiving data" name="" value="0x1"/>
         <value caption="RX logic is idle" name="" value="0x0"/>
      </value-group>
