Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_EF_DFP/1.0.29/atdf/PIC32MZ1024EFH144.atdf
         <register caption="Interrupt Vector Address Offset Registe" name="OFF062" offset="0x638" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF"/>
         </register>
         <register caption="Interrupt Vector Address Offset Registe" name="OFF063" offset="0x63c" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF"/>
         </register>
         <register caption="Interrupt Vector Address Offset Registe" name="OFF064" offset="0x640" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF"/>
         </register>
         <register caption="Interrupt Vector Address Offset Registe" name="OFF065" offset="0x644" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF"/>
         </register>
         <register caption="Interrupt Vector Address Offset Registe" name="OFF066" offset="0x648" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF"/>
         </register>
         <register caption="Interrupt Vector Address Offset Registe" name="OFF067" offset="0x64c" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF"/>
         </register>
         <register caption="Interrupt Vector Address Offset Registe" name="OFF068" offset="0x650" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF"/>
         </register>
         <register caption="Interrupt Vector Address Offset Registe" name="OFF069" offset="0x654" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF"/>
         </register>
         <register caption="Interrupt Vector Address Offset Registe" name="OFF070" offset="0x658" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF"/>
         </register>
         <register caption="Interrupt Vector Address Offset Registe" name="OFF071" offset="0x65c" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF"/>
         </register>
         <register caption="Interrupt Vector Address Offset Registe" name="OFF072" offset="0x660" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF"/>
         </register>
         <register caption="Interrupt Vector Address Offset Registe" name="OFF073" offset="0x664" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF"/>
         </register>
         <register caption="Interrupt Vector Address Offset Registe" name="OFF074" offset="0x668" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF"/>
         </register>
         <register caption="Interrupt Vector Address Offset Registe" name="OFF075" offset="0x66c" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF"/>
         </register>
         <register caption="Interrupt Vector Address Offset Registe" name="OFF076" offset="0x670" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF"/>
         </register>
         <register caption="Interrupt Vector Address Offset Registe" name="OFF077" offset="0x674" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF"/>
         </register>
         <register caption="Interrupt Vector Address Offset Registe" name="OFF078" offset="0x678" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF"/>
         </register>
         <register caption="Interrupt Vector Address Offset Registe" name="OFF079" offset="0x67c" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF"/>
         </register>
         <register caption="Interrupt Vector Address Offset Registe" name="OFF080" offset="0x680" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF"/>
         </register>
         <register caption="Interrupt Vector Address Offset Registe" name="OFF081" offset="0x684" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF"/>
         </register>
         <register caption="Interrupt Vector Address Offset Registe" name="OFF082" offset="0x688" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF"/>
         </register>
         <register caption="Interrupt Vector Address Offset Registe" name="OFF083" offset="0x68c" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF"/>
         </register>
         <register caption="Interrupt Vector Address Offset Registe" name="OFF084" offset="0x690" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF"/>
         </register>
         <register caption="Interrupt Vector Address Offset Registe" name="OFF085" offset="0x694" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF"/>
         </register>
         <register caption="Interrupt Vector Address Offset Registe" name="OFF086" offset="0x698" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF"/>
         </register>
         <register caption="Interrupt Vector Address Offset Registe" name="OFF087" offset="0x69c" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF"/>
         </register>
         <register caption="Interrupt Vector Address Offset Registe" name="OFF088" offset="0x6a0" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF"/>
         </register>
         <register caption="Interrupt Vector Address Offset Registe" name="OFF089" offset="0x6a4" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF"/>
         </register>
         <register caption="Interrupt Vector Address Offset Registe" name="OFF090" offset="0x6a8" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF"/>
         </register>
         <register caption="Interrupt Vector Address Offset Registe" name="OFF091" offset="0x6ac" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF"/>
         </register>
         <register caption="Interrupt Vector Address Offset Registe" name="OFF092" offset="0x6b0" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF"/>
         </register>
         <register caption="Interrupt Vector Address Offset Registe" name="OFF093" offset="0x6b4" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF"/>
         </register>
         <register caption="Interrupt Vector Address Offset Registe" name="OFF094" offset="0x6b8" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF"/>
         </register>
